13-intro-to-rails/pokedex/app/controllers/pokemons_controller.rb

  def index
    @pokemons = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"