32-oject-oriented-javascript/movies-api/app/controllers/api/v1/movies_controller.rb

  def index
    movies = Movie.all.sort_by { |movie| movie.title }
---
SELECT "movies".* FROM "movies"

  def create
    movie = Movie.create(movie_params)
---
INSERT INTO "movies" ("score", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["score", 20], ["created_at", "2020-03-16 14:57:32.380645"], ["updated_at", "2020-03-16 14:57:32.380645"]]

  def update
    movie = Movie.find(params[:id])
    movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "movies" SET "score" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["score", 7], ["updated_at", "2020-04-06 18:24:34.765097"], ["id", 23]]

  def destroy
    movie = Movie.find(params[:id])
    movie.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 23]]