13-intro-to-rails/blog-app/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "author", "like_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "intro to rails"], ["content", "rails is cool"], ["author", "steven"], ["like_count", 5], ["created_at", "2020-03-11 18:36:49.082299"], ["updated_at", "2020-03-11 18:36:49.082299"]]